Pavuter/ble/nRF51_SDK_9.0.0_2e23562_1/examples/ble_peripheral/ble_app_uart/main.c
/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' i.e '\n' (hex 0x0D) or if the string has reached a length of
 *          @ref NUS_MAX_DATA_LENGTH.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
//    uint32_t       err_code = NRF_SUCCESS;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;
//            if ((data_array[index - 1] == 0xff) || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
              ble_recive_add_node( data_array, index );
              index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
					LOG("APP_UART_COMMUNICATION_ERROR.\r\n");
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
					LOG("APP_UART_FIFO_ERROR.\r\n");
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


static void sys_task_register(void){
  
  /* switch control */
  AddTask_TmrQueue( 0, 300, switch_control_task );
  
  /* switch status update report */
  AddTask_TmrQueue( 0, 200, ble_device_status_update_report_task );
  
  /* scanning timing events */
	AddTask_TmrQueue( 0, 1000, timing_event_scan_task ); // dm_test_update
	
  /* Flash data update task */
//  AddTask_TmrQueue( 1000, 300, ble_flash_data_update_task );
  
  /* lowlayer protocol */
  AddTask_TmrQueue( 50, 50, ble_lowlayer_preodic_recv ); // 获取蓝牙接收链表的数据
	AddTask_TmrQueue( 50, 50, ble_lowlayer_preodic_send ); // 获取蓝牙发送链表的数据
	AddTask_TmrQueue( 50, 30, ble_send_task); // 自动发送
  
  /* middlelayer protocol */
  AddTask_TmrQueue( 10000, 60000, ble_device_heartbeat );
//  AddTask_TmrQueue( 10000, 60000, ble_device_time_sync );
}

/**@brief Application main function.


BSP_UART_SUPPORT
ENABLE_DEBUG_LOG_SUPPORT

 */
int main(void)
{
  uint32_t err_code;
#if 1
	APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);

  uart_init();
  dm_flash_init();
  app_calendar_init();
  bsp_button_led_init();
  timing_init();
  app_protocol_init();
  sys_task_register(); // 系统任务注册
  
  //buttons_leds_init(&erase_bonds);
  ble_stack_init();
  gap_params_init();
  services_init();
  advertising_init();
  conn_params_init();

//  err_code = ble_radio_notification_init( NRF_APP_PRIORITY_LOW, 
//                                          NRF_RADIO_NOTIFICATION_DISTANCE_5500US, 
//                                          ble_flash_on_radio_active_evt);
//  APP_ERROR_CHECK(err_code);
  
  err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
  APP_ERROR_CHECK(err_code);

  // Enter main loop.
  for (;;){
    power_manage(); 
    key_event_fsm();
    FuncTmrQueueMgr();
  }
#else
  for(;;);
#endif
}

#if 0
static void example_cb_handler(pstorage_handle_t  * handle,
															 uint8_t              op_code,
                               uint32_t             result,
                               uint8_t            * p_data,
                               uint32_t             data_len)
{
		if(handle->block_id == pstorage_wait_handle) { pstorage_wait_flag = 0; }  //If we are waiting for this callback, clear the wait flag.
	
