Pavuter/ble/nRF51_SDK_9.0.0_2e23562_1/examples/ble_peripheral/ble_app_uart/main.c
		switch(op_code)
		{
			case PSTORAGE_LOAD_OP_CODE:
				 if (result == NRF_SUCCESS)
				 {
						 printf("pstorage LOAD callback received \r\n");
//						 bsp_indication_set(BSP_INDICATE_ALERT_0);				 
				 }
				 else
				 {
						 printf("pstorage LOAD ERROR callback received \r\n");
//						 bsp_indication_set(BSP_INDICATE_RCV_ERROR);
				 }
				 break;
			case PSTORAGE_STORE_OP_CODE:
				 if (result == NRF_SUCCESS)
				 {
						 printf("pstorage STORE callback received \r\n");
//						 bsp_indication_set(BSP_INDICATE_ALERT_1);
				 }
				 else
				 {
					   printf("pstorage STORE ERROR callback received \r\n");
//						 bsp_indication_set(BSP_INDICATE_RCV_ERROR);
				 }
				 break;				 
			case PSTORAGE_UPDATE_OP_CODE:
				 if (result == NRF_SUCCESS)
				 {
						 printf("pstorage UPDATE callback received \r\n");
//						 bsp_indication_set(BSP_INDICATE_ALERT_2);
				 }
				 else
				 {
						 printf("pstorage UPDATE ERROR callback received \r\n");
//						 bsp_indication_set(BSP_INDICATE_RCV_ERROR);
				 }
				 break;
			case PSTORAGE_CLEAR_OP_CODE:
				 if (result == NRF_SUCCESS)
				 {
						 printf("pstorage CLEAR callback received \r\n");
//						 bsp_indication_set(BSP_INDICATE_ALERT_3);
				 }
				 else
				 {
					   printf("pstorage CLEAR ERROR callback received \r\n");
//						 bsp_indication_set(BSP_INDICATE_RCV_ERROR);
				 }
				 break;	 
		}			
}

static void pstorage_test_store_and_update(void)
{
		pstorage_handle_t       handle;
		pstorage_handle_t				block_0_handle;
		pstorage_handle_t				block_1_handle;
		pstorage_handle_t				block_2_handle;
		pstorage_module_param_t param;
		uint8_t                 source_data_0[16] = {0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F};
		uint8_t                 source_data_1[16] = {0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18, 0x19, 0x1A, 0x1B, 0x1C, 0x1D, 0x1E, 0x1F};
		uint8_t                 source_data_2[16] = {0x20, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28, 0x29, 0x2A, 0x2B, 0x2C, 0x2D, 0x2E, 0x2F};
		uint8_t                 source_data_9[16] = {'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', '\0'};
		uint8_t                 dest_data_0[16];
		uint8_t                 dest_data_1[16];
		uint8_t                 dest_data_2[16];
		uint32_t                retval;
		
		retval = pstorage_init();
		if(retval != NRF_SUCCESS)
		{
				bsp_indication_set(BSP_INDICATE_FATAL_ERROR);
		}
	     
		param.block_size  = 16;                   //Select block size of 16 bytes
		param.block_count = 4;                   //Select 10 blocks, total of 160 bytes
		param.cb          = example_cb_handler;   //Set the pstorage callback handler
			
		printf("\r\n\r\npstorage initializing ... \r\n");
		retval = pstorage_register(&param, &handle);
		if (retval != NRF_SUCCESS)
		{
//				bsp_indication_set(BSP_INDICATE_FATAL_ERROR);
      printf("register failed.\r\n");
		}
		
//		//Get block identifiers
		pstorage_block_identifier_get(&handle, 0, &block_0_handle);
		pstorage_block_identifier_get(&handle, 1, &block_1_handle);
		pstorage_block_identifier_get(&handle, 2, &block_2_handle);
		
		//Clear 100 bytes, i.e. one block
		printf("pstorage clear 48 bytes from block 0 \r\n");
		retval = pstorage_clear(&block_0_handle, 48);                       
		if(retval != NRF_SUCCESS)  { 
//      bsp_indication_set(BSP_INDICATE_RCV_ERROR); 
    }
		
		//Store data to three blocks. Wait for the last store operation to finish before reading out the data.
		printf("pstorage store into block 0 \r\n");
		pstorage_store(&block_0_handle, source_data_0, 16, 0);     //Write to flash, only one block is allowed for each pstorage_store command
		if(retval != NRF_SUCCESS)
		{
//				bsp_indication_set(BSP_INDICATE_RCV_ERROR);
      printf("store failed.\r\n");
		}
		
		printf("pstorage store into block 1 \r\n");
		pstorage_store(&block_1_handle, source_data_1, 16, 0);     //Write to flash, only one block is allowed for each pstorage_store command		
		pstorage_wait_handle = block_2_handle.block_id;            //Specify which pstorage handle to wait for
		pstorage_wait_flag = 1;                                    //Set the wait flag. Cleared in the example_cb_handler
		printf("pstorage store into block 2\r\n");
		pstorage_store(&block_2_handle, source_data_9, 16, 0);     //Write to flash
		printf("pstorage wait for block 2 store to complete ... \r\n");
		while(pstorage_wait_flag) { power_manage(); }              //Sleep until store operation is finished.
		
		printf("pstorage load blocks 0 \r\n");
		pstorage_load(dest_data_0, &block_0_handle, 16, 0);				 //Read from flash, only one block is allowed for each pstorage_load command
		printf("Data loaded from block 0\r\n");
    app_trace_dump( dest_data_0, 16 );
    
    printf("pstorage load blocks 1 \r\n");
		pstorage_load(dest_data_1, &block_1_handle, 16, 0);				 //Read from flash
		printf("Data loaded from block 1\r\n");
    app_trace_dump( dest_data_1, 16 );
    
    printf("pstorage load blocks 2\r\n");
		pstorage_load(dest_data_2, &block_2_handle, 16, 0);			   //Read from flash
		printf("Data loaded from block 2\r\n");
		app_trace_dump( dest_data_2, 16 );
		
    printf("pstorage clear 32 bytes from block 0 \r\n");
		pstorage_wait_handle = block_0_handle.block_id;            //Specify which pstorage handle to wait for
		pstorage_wait_flag = 1;                                    //Set the wait flag. Cleared in the example_cb_handler
		pstorage_clear(&block_0_handle, 32);                       //Clear 32 bytes
		printf("pstorage wait for clear to complete ... \r\n");
		while(pstorage_wait_flag) { power_manage(); }              //Sleep until store operation is finished.
		
		printf("pstorage load blocks 0  \r\n");
		pstorage_load(dest_data_0, &block_0_handle, 16, 0);				 //Read from flash, only one block is allowed for each pstorage_load command
		printf("Data loaded from block 0\r\n");
    app_trace_dump( dest_data_0, 16 );
    
    printf("pstorage load blocks 1 \r\n");
		pstorage_load(dest_data_1, &block_1_handle, 16, 0);				 //Read from flash
    printf("Data loaded from block 1\r\n");
    app_trace_dump( dest_data_1, 16 );
		
    printf("pstorage load blocks 2 \r\n");
		pstorage_load(dest_data_2, &block_2_handle, 16, 0);			   //Read from flash
    printf("Data loaded from block 2\r\n");
    app_trace_dump( dest_data_2, 16 );
    
		printf("pstorage update block 0 \r\n");
		pstorage_wait_handle = block_0_handle.block_id;            //Specify which pstorage handle to wait for 
		pstorage_wait_flag = 1;                                    //Set the wait flag. Cleared in the example_cb_handler
		pstorage_update(&block_0_handle, source_data_9, 16, 0);    //update flash block 0
		printf("pstorage wait for update to complete ... \r\n");
		while(pstorage_wait_flag) { power_manage(); }              //Sleep until update operation is finished.
		
		printf("pstorage load blocks 0  \r\n");
		pstorage_load(dest_data_0, &block_0_handle, 16, 0);				 //Read from flash, only one block is allowed for each pstorage_load command
		app_trace_dump( dest_data_0, 16 );
    
    printf("pstorage load blocks 1 \r\n");
		pstorage_load(dest_data_1, &block_1_handle, 16, 0);				 //Read from flash
    app_trace_dump( dest_data_1, 16 );
		
    printf("pstorage load blocks 2 \r\n");
		pstorage_load(dest_data_2, &block_2_handle, 16, 0);			   //Read from flash
    app_trace_dump( dest_data_2, 16 );
}
#endif
/**
 * @}
 */
